In [11]:
import pandas as pd

In [12]:
one =pd.read_excel('one.xlsx')

In [13]:
one

   numbers alpha  Unnamed: 2   nums
0       12    aa         NaN   12.0
1       45    bb         NaN   45.0
2       56    cc         NaN   56.0
3       34    dd         NaN   34.0
4       23    ee         NaN   23.0
5      765    ff         NaN  765.0
6      190    gg         NaN  190.0
7        8    hh         NaN    NaN
8        9    ii         NaN    NaN
9       10    jj         NaN    NaN

In [14]:
one.rename(columns={'Unnamed: 2':'Unknow'}, inplace=True)

In [15]:
one

   numbers alpha  Unknow   nums
0       12    aa     NaN   12.0
1       45    bb     NaN   45.0
2       56    cc     NaN   56.0
3       34    dd     NaN   34.0
4       23    ee     NaN   23.0
5      765    ff     NaN  765.0
6      190    gg     NaN  190.0
7        8    hh     NaN    NaN
8        9    ii     NaN    NaN
9       10    jj     NaN    NaN

In [16]:
one.columns

Index(['numbers', 'alpha', 'Unknow', 'nums'], dtype='object')

In [17]:
one.describe()

          numbers  Unknow        nums
count   10.000000     0.0    7.000000
mean   115.200000     NaN  160.714286
std    234.721963     NaN  273.102981
min      8.000000     NaN   12.000000
25%     10.500000     NaN   28.500000
50%     28.500000     NaN   45.000000
75%     53.250000     NaN  123.000000
max    765.000000     NaN  765.000000

In [19]:
one['numbers'].mean()

115.2

In [20]:
import sqlite3

In [21]:
conn =sqlite3.connect('sports.db')

In [22]:
q = "select * from players"

In [23]:
two= pd.read_sql_query(q,conn)

DatabaseError: Execution failed on sql 'select * from players': no such table: players